bench/custom/logs/rfuse/ramdisk/fsync/rfuse_write_0-7.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=8225: Wed May 29 16:28:55 2024
  write: IOPS=59.1k, BW=231MiB/s (242MB/s)(32.0GiB/141914msec); 0 zone resets
    clat (usec): min=7, max=77589, avg=478.07, stdev=129.96
     lat (usec): min=7, max=77589, avg=478.13, stdev=129.96
    clat percentiles (usec):
     |  1.00th=[  215],  5.00th=[  347], 10.00th=[  392], 20.00th=[  420],
     | 30.00th=[  449], 40.00th=[  469], 50.00th=[  482], 60.00th=[  494],
     | 70.00th=[  510], 80.00th=[  537], 90.00th=[  562], 95.00th=[  594],
     | 99.00th=[  685], 99.50th=[  824], 99.90th=[  963], 99.95th=[ 1012],
     | 99.99th=[ 1123]
   bw (  KiB/s): min=210839, max=489918, per=100.00%, avg=236721.81, stdev=739.29, samples=9028
   iops        : min=52702, max=122475, avg=59177.33, stdev=184.85, samples=9028
  lat (usec)   : 10=0.01%, 20=0.12%, 50=0.36%, 100=0.09%, 250=0.64%
  lat (usec)   : 500=61.89%, 750=36.22%, 1000=0.62%
  lat (msec)   : 2=0.05%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=4, max=33580, avg=484.18, stdev=118.71
    sync percentiles (usec):
     |  1.00th=[  237],  5.00th=[  359], 10.00th=[  400], 20.00th=[  433],
     | 30.00th=[  461], 40.00th=[  478], 50.00th=[  486], 60.00th=[  498],
     | 70.00th=[  515], 80.00th=[  537], 90.00th=[  570], 95.00th=[  594],
     | 99.00th=[  685], 99.50th=[  848], 99.90th=[  971], 99.95th=[ 1012],
     | 99.99th=[ 1123]
  cpu          : usr=0.21%, sys=24.08%, ctx=2034551873, majf=0, minf=379
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=231MiB/s (242MB/s), 231MiB/s-231MiB/s (242MB/s-242MB/s), io=32.0GiB (34.4GB), run=141914-141914msec