bench/custom/logs/rfuse/ramdisk/fsync/rfuse_write_0.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=7571: Wed May 29 16:14:09 2024
  write: IOPS=8001, BW=31.3MiB/s (32.8MB/s)(32.0GiB/1048358msec); 0 zone resets
    clat (usec): min=8, max=42478, avg=3552.24, stdev=383.80
     lat (usec): min=8, max=42478, avg=3552.31, stdev=383.80
    clat percentiles (usec):
     |  1.00th=[ 2933],  5.00th=[ 3064], 10.00th=[ 3163], 20.00th=[ 3261],
     | 30.00th=[ 3359], 40.00th=[ 3425], 50.00th=[ 3523], 60.00th=[ 3654],
     | 70.00th=[ 3752], 80.00th=[ 3851], 90.00th=[ 3982], 95.00th=[ 4113],
     | 99.00th=[ 4359], 99.50th=[ 4424], 99.90th=[ 4752], 99.95th=[ 5276],
     | 99.99th=[ 7373]
   bw (  KiB/s): min=27302, max=108612, per=100.00%, avg=32020.12, stdev=72.16, samples=66770
   iops        : min= 6821, max=27139, avg=7994.99, stdev=18.02, samples=66770
  lat (usec)   : 10=0.01%, 20=0.03%, 50=0.09%, 100=0.01%, 250=0.05%
  lat (usec)   : 500=0.08%, 750=0.03%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=90.03%, 10=9.67%, 20=0.01%, 50=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=3, max=36483, avg=3560.97, stdev=390.21
    sync percentiles (usec):
     |  1.00th=[ 2966],  5.00th=[ 3097], 10.00th=[ 3163], 20.00th=[ 3261],
     | 30.00th=[ 3359], 40.00th=[ 3458], 50.00th=[ 3556], 60.00th=[ 3654],
     | 70.00th=[ 3752], 80.00th=[ 3851], 90.00th=[ 3982], 95.00th=[ 4113],
     | 99.00th=[ 4359], 99.50th=[ 4424], 99.90th=[ 4817], 99.95th=[ 5342],
     | 99.99th=[ 7570]
  cpu          : usr=0.04%, sys=2.99%, ctx=1610833988, majf=0, minf=359
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=31.3MiB/s (32.8MB/s), 31.3MiB/s-31.3MiB/s (32.8MB/s-32.8MB/s), io=32.0GiB (34.4GB), run=1048358-1048358msec