bench/custom/logs/rfuse/ramdisk/fsync/rfuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=4765: Thu May 30 02:50:51 2024
  write: IOPS=1339k, BW=5231MiB/s (5485MB/s)(32.0GiB/6264msec); 0 zone resets
    clat (usec): min=6, max=6877, avg=20.31, stdev= 5.88
     lat (usec): min=6, max=6877, avg=20.43, stdev= 5.90
    clat percentiles (nsec):
     |  1.00th=[10816],  5.00th=[13376], 10.00th=[14528], 20.00th=[16320],
     | 30.00th=[17792], 40.00th=[19072], 50.00th=[20096], 60.00th=[21120],
     | 70.00th=[22400], 80.00th=[23936], 90.00th=[25984], 95.00th=[28032],
     | 99.00th=[32640], 99.50th=[35584], 99.90th=[47872], 99.95th=[54016],
     | 99.99th=[76288]
   bw (  MiB/s): min= 4900, max= 6762, per=100.00%, avg=5509.38, stdev=16.40, samples=365
   iops        : min=1254550, max=1731266, avg=1410400.49, stdev=4197.15, samples=365
  lat (usec)   : 10=0.35%, 20=48.45%, 50=51.12%, 100=0.07%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=4, max=1618, avg=11.51, stdev= 3.22
    sync percentiles (nsec):
     |  1.00th=[ 6048],  5.00th=[ 7584], 10.00th=[ 8256], 20.00th=[ 9280],
     | 30.00th=[10176], 40.00th=[10816], 50.00th=[11328], 60.00th=[11968],
     | 70.00th=[12608], 80.00th=[13376], 90.00th=[14528], 95.00th=[15680],
     | 99.00th=[19328], 99.50th=[21632], 99.90th=[33536], 99.95th=[37120],
     | 99.99th=[48896]
  cpu          : usr=4.87%, sys=35.65%, ctx=9441113, majf=0, minf=480
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5231MiB/s (5485MB/s), 5231MiB/s-5231MiB/s (5485MB/s-5485MB/s), io=32.0GiB (34.4GB), run=6264-6264msec